In [2]:
import pandas as pd

In [12]:
home_data = pd.read_csv("https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/house_rental_data.csv.txt",index_col ='Unnamed: 0')

In [13]:
home_data

         Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom  Price
1    1177.698      2           7        2            2         2  62000
2    2134.800      5           7        4            2         2  78000
3    1138.560      5           7        2            2         1  58000
4    1458.780      2           7        3            2         2  45000
5     967.776     11          14        3            2         2  45000
..        ...    ...         ...      ...          ...       ...    ...
644  1359.156      7          15        3            2         2  45000
645   377.148      4          10        1            1         1  24800
646   740.064     13          14        1            1         1  45000
647  1707.840      3          14        3            2         2  65000
648  1376.946      6           7        3            2         1  36000

[645 rows x 7 columns]

In [14]:
from sklearn.linear_model import LinearRegression

In [15]:
lr = LinearRegression()

In [16]:
feature_data = home_data.drop("Price",axis = 1)

In [17]:
target_data = home_data.Price

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
trainX,testX,trainY,testY = train_test_split(feature_data,target_data)

In [20]:
lr.fit(trainX,trainY)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [29]:
lr.predict(testX[:3])

array([58999.92538649, 73622.30851508, 28104.48379319])

In [27]:
testX[:2]

         Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom
377  1501.476      4           4        4            2         2
173  1921.320      4           7        4            2         2

In [30]:
testY[:3]

377    52000
173    48000
579    28800
Name: Price, dtype: int64

In [32]:
h_data = pd.read_csv("https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/house_rental_data.csv.txt",index_col ='Unnamed: 0')

In [33]:
h_data

         Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom  Price
1    1177.698      2           7        2            2         2  62000
2    2134.800      5           7        4            2         2  78000
3    1138.560      5           7        2            2         1  58000
4    1458.780      2           7        3            2         2  45000
5     967.776     11          14        3            2         2  45000
..        ...    ...         ...      ...          ...       ...    ...
644  1359.156      7          15        3            2         2  45000
645   377.148      4          10        1            1         1  24800
646   740.064     13          14        1            1         1  45000
647  1707.840      3          14        3            2         2  65000
648  1376.946      6           7        3            2         1  36000

[645 rows x 7 columns]

In [34]:
from sklearn.linear_model import LinearRegression

In [35]:
lr = LinearRegression()

In [36]:
feature_data = h_data.drop("Price",axis = 1)

In [38]:
target_data = h_data.Price

In [41]:
from sklearn.model_selection import train_test_split

In [42]:
trainX, testX, trainY, testY = train_test_split(feature_data,target_data)

In [43]:
lr.fit(trainX,trainY)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [45]:
lr.predict(testX[:2])

array([86087.46021017, 42816.95476166])

In [46]:
testY[:2]

170    100000
243     41999
Name: Price, dtype: int64

In [47]:
import pandas as pd

In [48]:
h_data = pd.read_csv("https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/house_rental_data.csv.txt",index_col ='Unnamed: 0')

In [49]:
h_data

         Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom  Price
1    1177.698      2           7        2            2         2  62000
2    2134.800      5           7        4            2         2  78000
3    1138.560      5           7        2            2         1  58000
4    1458.780      2           7        3            2         2  45000
5     967.776     11          14        3            2         2  45000
..        ...    ...         ...      ...          ...       ...    ...
644  1359.156      7          15        3            2         2  45000
645   377.148      4          10        1            1         1  24800
646   740.064     13          14        1            1         1  45000
647  1707.840      3          14        3            2         2  65000
648  1376.946      6           7        3            2         1  36000

[645 rows x 7 columns]

In [50]:
from sklearn.linear_model import LinearRegression

In [51]:
lr = LinearRegression()

In [52]:
feature_data = h_data.drop("Price", axis =1)

In [53]:
target_data = h_data.Price

In [54]:
from sklearn.model_selection import train_test_split

In [55]:
trainX,testX, trainY,testY = train_test_split(feature_data,target_data)

In [56]:
lr.fit(trainX,trainY)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [57]:
lr.predict(testX[:2])

array([29977.49756358, 82288.7137269 ])

In [59]:
testY[:2]

57     36000
266    43000
Name: Price, dtype: int64

In [58]:
testX[:2]

         Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom
57    640.440      5           7        1            1         1
266  2138.358      6           7        3            2         2